app/controllers/blogs_controller.rb

SELECT  "blogs".* FROM "blogs"   ORDER BY "blogs"."id" ASC LIMIT 1
---
  def index
    if Blog.first.blank?

INSERT INTO "blogs" ("author", "created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "zé ninguém"], ["created_at", "2015-01-08 19:02:01.462124"], ["description", "desc"], ["title", "blogue"], ["updated_at", "2015-01-08 19:02:01.462124"]]
---
  def create
    @blog = Blog.new(blog_params)
    respond_to do |format|
      if @blog.save

SELECT  "blogs".* FROM "blogs"   ORDER BY "blogs"."id" ASC LIMIT 1
UPDATE "blogs" SET "title" = ?, "updated_at" = ? WHERE "blogs"."id" = 1  [["title", "brogu"], ["updated_at", "2015-01-08 19:48:10.786743"]]
---
  def update
    @blog = Blog.first
    respond_to do |format|
      if @blog.update(blog_params)