app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create!(comment_params)
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "created_at", "name", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "sdsfv"], ["created_at", "2015-01-08 17:16:53.559197"], ["name", "aa"], ["post_id", 1], ["updated_at", "2015-01-08 17:16:53.559197"]]