app/controllers/posts_controller.rb

SELECT  "blogs".* FROM "blogs"   ORDER BY "blogs"."id" ASC LIMIT 1
SELECT "posts".* FROM "posts"
---
  def index
    @blog = Blog.first
    @posts = Post.all

SELECT  "blogs".* FROM "blogs"   ORDER BY "blogs"."id" ASC LIMIT 1
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_post
      if Blog.first.blank?
        redirect_to blogs_path
      end
      @blog = Blog.first
      @post = Post.find(params[:id])